Revit 2027 API
BuiltInFailures.ViewFailures.ReloadLatestDeletedLastOpenView Property
 The only open view has been deleted because of changes from the Central Model. Open another view and Reload Latest or Synchronize with Central again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReloadLatestDeletedLastOpenView { get; }
Public Shared ReadOnly Property ReloadLatestDeletedLastOpenView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReloadLatestDeletedLastOpenView {
	FailureDefinitionId^ get ();
}
static member ReloadLatestDeletedLastOpenView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace